{
  "aries": "Today brings straightforward energy for Aries. You'll feel ready to tackle practical tasks and make steady progress on a project that matters. Speak clearly about your needs and set realistic boundaries; others will respect honest communication. If a decision feels rushed, pause to list the facts before choosing. Small, consistent actions build momentum—choose one concrete step and follow through. In the evening, take time for a relaxing routine that helps you recharge for tomorrow.",
  "taurus": "Taurus, focus on a clear goal this week and break it into three concrete steps: define the outcome, set a realistic timeline, and schedule daily actions. Keep your eyes on progress, not perfection, and track measurable milestones so you can adjust quickly. Ask a trusted colleague or mentor for feedback and commit to one habit that moves you forward. If self-doubt appears, treat it like a passing thought—call on an inner \"angel\" of encouragement and keep pushing with steady effort.",
  "gemini": "Gemini, focus on one clear goal this week instead of scattering your energy. Identify the specific outcome you want, set a realistic timeline, and break it into three concrete tasks you can start today. Use your curiosity to learn one new skill that moves you forward, then practice it consistently. Keep your eyes on progress, not perfection. When doubts appear, treat your inner critic like an annoyed angel—acknowledge it and then move on. Small, steady actions will get you where you want.",
  "cancer": "Cancer, today your intuition guides warm, meaningful connections. A close friend may reveal something that deepens trust; listen with your heart and ask gentle questions. At home, small acts of care soften tensions—offer help without expecting thanks. If romance feels uncertain, share one vulnerable truth rather than hiding behind humor; honesty invites closeness. Evening moments are best spent with someone who remembers the little things. Let empathy lead; it will strengthen bonds and bring surprising comfort.",
  "leo": "Leo, this week the spotlight warms your closest connections. Friendships deepen through honest conversation — offer your generous attention and listen more than usual; you’ll be surprised how much trust grows. Family ties may call for gentle compromise; a small gesture can ease lingering tensions. In romance, confidence is attractive but softness creates intimacy; share a vulnerable moment. Expect pleasant synchrony: when you show up authentically, others mirror you, strengthening bonds that matter most. Embrace warmth and steady presence.",
  "virgo": "Virgo: focus on your long-term goals and break them into clear, manageable steps. Keep your eyes on priorities, set realistic deadlines, and track progress weekly. Build skills that directly move you forward, and seek feedback to refine your approach. If an \"angel\" — a mentor or supportive colleague — offers guidance, accept it and return the favor later. Stay consistent, reassess plans when needed, and",
  "libra": "Today encourages Libra to prioritize clear communication and simple fairness. If a relationship or work interaction feels off, address it calmly and state what you need. Small, steady choices will restore balance more than big gestures. Take time to organize tasks so you can focus on what matters most. A creative idea could bring pleasing results if you follow through with consistent effort. End the day with something that relaxes you and reminds you why balance matters.",
  "scorpio": "Scorpio, focus on one clear goal this week and break it into concrete steps. Keep your eyes on measurable progress—track tasks, set deadlines, and ask for feedback from people who know your field. Use your intensity for consistent action rather than scattered effort. If doubt creeps in, picture someone who believes in you—call them your “angel” for a quick confidence boost—and ask for practical help. Small daily wins will move you steadily toward larger ambitions.",
  "sagittarius": "Today brings a practical opportunity to focus on relationships and personal goals. Clear communication will smooth a misunderstanding if you take time to listen and express what you need calmly. Prioritize one meaningful task rather than scattering energy across many small projects — quality over quantity will give better results. A small change in routine can lift your mood and increase productivity. Evening is good for reconnecting with a friend or enjoying a quiet activity that helps you recharge. Stay steady and intentional.",
  "capricorn": "Capricorn, focus on clear goals today. Write down one specific dream and break it into concrete weekly steps. Keep your eyes on measurable progress, not perfection. Use routines to protect time for work, then review what’s effective and adjust. Don’t wait for motivation; start with small, consistent actions. Ask a trusted colleague or mentor for practical feedback — their help can feel like an angel when you’re stuck. Stay disciplined, track results, and celebrate each small win.",
  "aquarius": "Aquarius, today the currents of connection flow gently in your favor. Conversations with friends or a partner reveal new layers of understanding—listen with curiosity rather than haste. Old tensions may soften if you offer a bit of vulnerability; reciprocation could surprise you. Family dynamics call for patience and a steady presence rather than solving everything at once. Embrace small moments of warmth: a shared laugh, a handwritten note, or genuine attention will deepen bonds more than grand gestures. Trust the ties that matter.",
  "pisces": "Pisces, focus your eyes on concrete steps toward one clear goal this month. Break big dreams into weekly tasks, track progress, and remove one distraction that wastes time. Ask a trusted colleague or friend to hold you accountable — think of them as an angel who nudges you when motivation dips. Prioritize consistent action over waiting for inspiration. Adjust plans when data shows a better route, and celebrate small wins to keep momentum moving forward."
}