{
  "aries": "Aries, today you move like a rebel with a clear mission — decisive, sharp, uninterested in second-guessing. Make the bold call; your confidence carries it.",
  "taurus": "Taurus, your energy is dreamy and unhurried, like driving slow at dusk with soft music. Let the day unfold instead of structuring it. Something subtle but important becomes obvious.",
  "gemini": "Gemini, restless wind-in-your-hair energy hits. Switch locations, change the plan, take the scenic route. A spontaneous choice opens an unexpected opportunity.",
  "cancer": "Cancer, your vibe is quiet-dream cinema today. You read people easily, almost effortlessly. Use that softness to navigate conversations without absorbing anything heavy.",
  "leo": "Leo, rebel energy is all over you. You’re not here to follow the script. Break one rule — a routine, a pattern, a dynamic — and watch the whole day feel lighter.",
  "virgo": "Virgo, you’re in a gentle, dreamy flow. Tasks feel less rigid, more intuitive. Follow what feels natural instead of forcing a schedule; it leads you exactly where you need to be.",
  "libra": "Libra, you get a hit of rebellious clarity. You stop negotiating with indecision and choose the option that feels the most authentically you. Someone finds your decisiveness striking.",
  "scorpio": "Scorpio, your energy is dusk-dream mysterious. You’re quiet but magnetic, watching everything with sharper insight than usual. Trust the subtle pull you feel — it’s real.",
  "sagittarius": "Sagittarius, wind-in-your-hair movement calls you. Do something that creates momentum — a drive, a walk, a long loop through a part of town you’ve ignored. Motion brings answers.",
  "capricorn": "Capricorn, your day feels like a slow cinematic fade-in. You’re grounded, composed, and selective with your energy. Make choices that support long-term ease, not urgency.",
  "aquarius": "Aquarius, rebellious independence is your mood. You detach cleanly from expectations and redefine the day on your terms. The more space you take, the clearer your thinking becomes.",
  "pisces": "Pisces, you drift into a surreal, dreamy state where creativity comes in soft waves. Capture the ideas — they’re fleeting but meaningful. Romance feels intuitive, not effortful."
}
