{
  "aries": "Aries, today feels like the opening sequence of a film where the protagonist finally chooses direction. A decision you’ve been delaying becomes unavoidable — not in a stressful way, but in a clean, “this is what makes sense” way. Don’t look for approval; act from instinct. Someone around you adjusts their behavior based on your clarity. Lead by moving, not explaining.",
  "taurus": "Taurus, your day unfolds like a slow, steady tracking shot — warm light, calm pacing, no rush. But beneath the calm is a pointed truth: you’ve been tolerating more than feels good. Adjust one expectation or boundary, and the whole emotional tone of your day shifts. A romantic moment strengthens when you stop cushioning your needs.",
  "gemini": "Gemini, the energy is neon-lit and quick-cut today. You’re in a scene built for sharp dialogue and unexpected opportunity. A conversation reveals something useful — pay attention to what’s implied, not just what’s said. Follow the spark of curiosity wherever it leads. This is not a day to overthink; it’s a day to respond with precision.",
  "cancer": "Cancer, everything feels slightly slowed, like a dreamy handheld shot where you absorb more than you speak. The pointed message: your sensitivity is giving you information you keep ignoring. Trust your read on a situation, especially socially. A romantic dynamic becomes clearer when you stop interpreting it emotionally and see it behaviorally.",
  "leo": "Leo, you move through the day like a character written with a spotlight — subtle confidence, controlled charisma, steady presence. A situation calls for leadership, but not dramatic leadership — practical, grounded, “I’ll handle this” leadership. The moment you step into that role, things align effortlessly. Someone takes you more seriously than you realize.",
  "virgo": "Virgo, your scenes today feel like a perfectly crafted montage — edits, upgrades, adjustments that look small on-screen but change the entire trajectory. The pointed note: there’s one system in your life that no longer fits who you’re becoming. Update it. Efficiency isn’t about perfection; it’s about alignment. This shift frees up mental space immediately.",
  "libra": "Libra, your energy is cinematic romance today — not swoony, but intentional. A moment with someone becomes meaningful when you stop trying to keep everything balanced and say what you genuinely want. The pointed message: reciprocity matters. Notice who mirrors your effort and who mirrors your hesitation.",
  "scorpio": "Scorpio, you’re deep in noir energy — quiet, magnetic, observant with focus that feels like a lens tightening. The truth you uncover today is specific: someone’s actions reveal more than their words. Don’t react; store the information and adjust your moves accordingly. Mystery is your power, but clarity is your advantage.",
  "sagittarius": "Sagittarius, this is your road-movie sequence — open air, shifting landscapes, something inside you stretching. The pointed takeaway: you need novelty, not escape. Choose something that expands you rather than distracts you. A spontaneous decision today has long-term resonance.",
  "capricorn": "Capricorn, your vibe is director-level oversight — you see the structure behind every situation. The pointed message: one area of your life needs a cleaner system or firmer boundary. Fixing it won’t take long, but avoiding it is slowing you down. Handle it today and everything else moves more smoothly.",
  "aquarius": "Aquarius, your day feels like a subtle plot twist — not dramatic, but clarifying. The pointed insight: your independence has been protecting you but also blocking a connection that could matter. Loosen your grip just enough to let someone meet you. You don’t have to surrender autonomy to allow closeness.",
  "pisces": "Pisces, you’re in a dream-sequence scene — soft light, quiet intuition, a thought you can’t shake. The pointed message: your emotional clarity is sharper than you think. Don’t downplay your instincts about someone or something. Act on the impression that keeps returning — it’s pointing you toward alignment."
}
