{
  "aries": "Aries, today has a clean, straightforward rhythm. Handle the most annoying task first — it gives you momentum for everything else. Keep conversations short and direct; people follow your lead when you’re calm. A change in your environment, even small, sharpens your focus. Tonight, unplug early.",
  "taurus": "Taurus, you get clarity by reducing the noise. Cut one obligation that doesn’t matter and watch everything else feel lighter. A practical conversation helps you realign expectations with someone close. Keep your pace steady; no need to rush. An idea you shelved reappears with a more realistic angle.",
  "gemini": "Gemini, today rewards precision. Say exactly what you mean and skip the extras — it lands better than charm. A brief check-in resolves something lingering. Your brain wants stimulation, so give it something real: a podcast, a walk, a new route. Avoid multitasking; single-tasking works better today.",
  "cancer": "Cancer, today is about boundaries, not emotions. Define what’s yours to carry and what isn’t. Planning out the next 48 hours brings relief. A neutral tone helps you communicate clearly, especially with family. A small physical reset — cleaning, organizing, fresh air — clears mental space.",
  "leo": "Leo, momentum builds once you commit to one priority instead of five. People appreciate your steadiness more than your performance today. A clear question opens up a useful conversation. Tidy up your schedule; small changes free mental bandwidth. Save social energy for someone who actually matters.",
  "virgo": "Virgo, today feels efficient once you stop perfecting and start finishing. A simple system or list keeps you grounded. Someone’s feedback is more helpful than you expect — take the useful part, ignore the rest. A practical decision replaces overthinking. End the day with something low-stimulation.",
  "libra": "Libra, today is a recalibration day. You see where your time is leaking and can fix it quickly. A direct conversation goes smoother than the diplomatic version in your head. Choose one plan and commit rather than keeping every option open. By evening, you’ll feel more centered.",
  "scorpio": "Scorpio, priorities fall into place naturally today. Trust the order they show up in. A blunt truth — said kindly — clears tension with someone. Your focus is sharper than usual, so handle tasks that require precision. A small habit shift strengthens your sense of control.",
  "sagittarius": "Sagittarius, productivity improves when you slow down instead of speeding up. One key task deserves your full attention. A spontaneous idea is worth writing down; it’s better than the ones you forced. Conversations feel cleaner when you skip the jokes and get to the point. Keep the evening open.",
  "capricorn": "Capricorn, you operate best in structured bursts today. Break your work into chunks and stick to them. Someone respects your directness more than your restraint — speak clearly. A minor logistical fix solves a bigger annoyance. You end the day feeling more organized than you started.",
  "aquarius": "Aquarius, today you benefit from being present instead of strategic. Listen fully before responding; it changes the tone of a key conversation. A practical task you’ve ignored becomes surprisingly easy once you start. Simplify your surroundings to reduce mental clutter. Don’t overschedule your evening.",
  "pisces": "Pisces, emotional clarity hits quietly today. You see the difference between what you want and what you’ve been tolerating. A decision becomes easier when you write out the facts. A short walk or break resets your thinking. Keep communication simple; less explanation works better than more."
}
