{
  "aries": "Aries, you’re in full rebel mode today — windows down, music loud, zero apologies. Make the choice that feels like freedom. Someone’s reaction won’t sway you; you’re steering your own narrative.",
  "taurus": "Taurus, your day moves in a dreamy slow-focus way. Simple routines feel softer, warmer, more meaningful. Lean into the pacing — it helps you see what you actually want.",
  "gemini": "Gemini, wind-in-your-hair energy hits you midday. Do something spontaneous, even small. A shift in scenery or conversation opens a door you didn’t know was there.",
  "cancer": "Cancer, you’re in a cinematic-dreamy phase. Everything feels slightly slowed down in a good way — like you're observing life instead of reacting to it. Let the calm guide your decisions.",
  "leo": "Leo, rebellious confidence suits you today. Say the thing everyone’s thinking but won’t say. Your boldness doesn’t cause chaos — it clears the static.",
  "virgo": "Virgo, you move through the day like a soft-focus daydream. Nothing rushed, nothing loud. Use this calm state to make subtle but impactful lifestyle adjustments.",
  "libra": "Libra, rebel energy hits in your social life. You stop over-accommodating and choose the plan you actually want. Someone finds this version of you magnetic.",
  "scorpio": "Scorpio, your vibe is dreamy with an edge — like a night drive with no destination. Let your intuition lead instead of logic. A small risk feels oddly safe today.",
  "sagittarius": "Sagittarius, full wind-in-your-hair energy. You crave motion, adventure, expansion. Follow the impulse that feels alive — it points you somewhere refreshing.",
  "capricorn": "Capricorn, your day feels like a muted dusk dream — steady, intentional, quietly beautiful. Make a decision that supports long-term ease, not pressure.",
  "aquarius": "Aquarius, rebel mode activated. You detach from obligations that don’t feel true to you. This clean break gives you space to think bigger, cleaner, freer.",
  "pisces": "Pisces, you’re in a dreamy, floaty headspace that actually brings clarity. A romantic thought or creative idea lands softly but stays — pay attention to it."
}
