{
  "aries": "Aries, today is a momentum day. Something you’ve been putting off suddenly feels doable — handle it quickly and don’t look back. Evening brings a quiet moment that helps you reset your direction.",
  "taurus": "Taurus, upgrade one tiny part of your routine — your workspace, your skincare, your morning drink — and it shifts your whole vibe. A practical conversation goes smoother than expected.",
  "gemini": "Gemini, a creative idea shows up out of nowhere. Capture it before it fades. Social plans might shift last-minute, so stay flexible. A short walk helps you process something you didn’t realize was weighing on you.",
  "cancer": "Cancer, you get clarity about a long-term goal today. Outline what you actually want, not what feels safest. A neutral tone in conversations helps you avoid unnecessary emotional detours.",
  "leo": "Leo, focus on your surroundings. Clean one part of your space or refine your aesthetic — what you look at influences how you act today. Someone’s reaction surprises you in a good way.",
  "virgo": "Virgo, problem-solving comes easily right now. If something has been inefficient — a habit, a workflow, a system — redesign it. A quick message clears up a question you’ve been overthinking.",
  "libra": "Libra, a relationship moment comes into focus. You see what needs more effort and what needs distance. Don’t sugarcoat your needs today; clarity creates balance faster than charm.",
  "scorpio": "Scorpio, your ambition gets louder. Think bigger than you usually allow — the idea doesn’t have to be realistic yet. Cut one distraction so you can actually hear your own thoughts.",
  "sagittarius": "Sagittarius, movement is your medicine today. Change locations, rearrange furniture, or take a new route. A spontaneous plan ends up being way more meaningful than something scheduled.",
  "capricorn": "Capricorn, today is for logistics. Fix the small things you’ve been tolerating — a broken link, an unread email, an overdue chore. Once you clear the clutter, your bigger plans feel easier.",
  "aquarius": "Aquarius, someone’s perspective helps you solve a problem you’ve been stuck on. Don’t isolate yourself — talk it out. A small tech or routine upgrade boosts your productivity.",
  "pisces": "Pisces, a dream you’ve been quietly holding gains structure today. Sketch out the first few steps. In your personal life, respond slowly; this keeps everything grounded instead of reactive."
}
