{
  "aries": "Today you’ll feel a burst of energy that helps you tackle tasks with confidence. Focus on clear communication—state your needs simply and listen before responding. A small project can move forward if you set a realistic goal and stick to one priority at a time. In relationships, show patience; a direct but kind approach will resolve minor misunderstandings. Take short breaks to stay balanced and use your natural initiative to try something slightly outside your routine. Evening brings a chance to relax and recharge.",
  "taurus": "Taurus, focus on the goals you’ve kept in the back of your mind. Clear your eyes for practical priorities: list them, set deadlines, and break each into weekly tasks. Use your steady nature to build momentum; ask for one piece of help when tasks pile up. Track progress and adjust plans rather than waiting for perfect conditions. Someone close may act like an angel with timely support—accept it and reciprocate. Small, consistent actions will move you toward those dreams.",
  "gemini": "Gemini, today conversation opens doors: a candid chat with a friend or partner clarifies feelings and brings you closer. Be curious rather than defensive — asking questions softens tension and reveals unexpected warmth. Family interactions benefit from humor; a light-hearted comment can ease a lingering misunderstanding. If you feel restless, invite someone you trust on a short outing to reconnect. Small acts of attention will ripple outward, strengthening bonds and reminding you that closeness often grows from simple, consistent gestures.",
  "cancer": "Cancer — Focus on specific goals this week. Identify one long-term dream and break it into clear steps: list tasks, set deadlines, and track progress daily. Use your natural intuition, but verify details with research and honest feedback from a trusted colleague or mentor — don’t rely on wishful thinking. Keep your eyes on measurable milestones and adjust plans when needed. Expect support from someone who acts like an angel in practical ways; accept help but stay responsible for each step.",
  "leo": "Today brings steady momentum for you, Leo. At work, focus on one project at a time — your concentration will make steady progress and others will notice. Socially, be open and generous with your time; a clear conversation can strengthen an important relationship. Make room for a creative activity that relaxes you and boosts confidence. Pay attention to small details in plans and agreements to avoid misunderstandings. By evening, allow yourself quiet time to reflect and recharge for tomorrow.",
  "virgo": "Virgo, today your attentiveness becomes a gift to those you love. A quiet conversation reveals more warmth than you expected — listen more than you speak and let small gestures do the talking. Friends may lean on your steady presence; offer practical help but allow them space to grow. At home, patience softens old patterns; an apology or a shared laugh can reset the tone. If romance feels tentative, try curiosity over critique — asking about their world draws you closer.",
  "libra": "Libra, focus on clear goals this week. List one long-term dream and three specific next steps you can take toward it — calendar deadlines, people to contact, and a skill to practice. Keep your eyes on measurable progress, not perfection. Ask a trusted colleague or friend for accountability; treat that check-in like an angel on your shoulder reminding you to follow through. Small, consistent actions will move you forward faster than sporadic bursts of effort.",
  "scorpio": "Today brings clarity for Scorpio. You’ll notice what truly matters in relationships and work; prioritize honest conversations and straightforward boundaries. A small, practical change in your routine will free energy for creative projects. Trust your instincts when choosing where to invest time, and don’t be afraid to say no to obligations that drain you. Reach out to one friend for a real check-in; their perspective will be useful. End your day with a calming activity to reset for tomorrow.",
  "sagittarius": "Today brings practical clarity for Sagittarius. You’ll find it easier to prioritize tasks and finish what matters most. Communicate directly with colleagues and loved ones; honest conversations lead to smoother plans and fewer misunderstandings. New opportunities for skill-building appear—consider a short course or focused practice to sharpen a talent. Make time for a hobby that relaxes you and boosts confidence. Be open to small changes in your routine; they can create steady momentum toward goals without drastic upheaval.",
  "capricorn": "Today favors steady progress. Focus on one practical task at a time and prioritize what moves you forward. Clear communication will smooth a work or family interaction—say what you need simply and listen. Small, consistent efforts will produce visible results by week’s end. Take time for a short break to recharge; a brief walk or tidy-up can reset your energy. Trust your planning skills, but remain open to a better idea from someone you respect. Evening brings calm satisfaction.",
  "aquarius": "Aquarius, today your natural warmth draws others in—lean into conversations with curiosity rather than solutions. A friend may reveal something that deepens your bond; listen and ask thoughtful questions. At home, small gestures smooth tensions and remind loved ones you care, even when you crave space. In romance, honesty tinged with gentleness opens new understanding; share a quirky idea or plan and watch the spark of connection grow. Prioritize presence over perfection, and relationships will glow brighter.",
  "pisces": "Today brings steady emotional clarity for Pisces. You’ll notice what truly matters in relationships and can speak honestly without drama. Focus on small, practical steps toward a personal goal; consistency will bring progress. If a decision feels heavy, pause and list pros and cons before acting. Spend time near water or take a short walk to reset your mood. Reach out to a trusted friend for perspective—support is available, and a straightforward conversation can ease the way forward."
}