{
  "aries": "Aries, a creative idea takes shape today — not loud, just quietly brilliant. Act on it while the spark is warm. Your confidence reads clean and people naturally follow your direction.",
  "taurus": "Taurus, romance settles into clarity. You understand someone’s intentions without guessing. Say what you want directly — it strengthens the connection instead of complicating it.",
  "gemini": "Gemini, travel energy is loud. Browse destinations or plan a quick escape; exploring options opens up your mindset. A surprising message reshapes your social plans.",
  "cancer": "Cancer, money decisions become simpler once you remove emotion from the equation. A practical choice today protects your future self and lightens your mental load.",
  "leo": "Leo, self-confidence arrives in a subtle, grounded way. You’re not performing — you’re just sure. Use that energy to make a bolder move toward a long-term goal.",
  "virgo": "Virgo, your lifestyle needs a small recalibration. Rearrange your space, fix what’s been bothering you, or update your schedule. A cleaner environment sharpens your ambition.",
  "libra": "Libra, romance feels more aligned when you stop filtering yourself. Give someone the honest version of your thoughts. The response is better than the diplomatic version you rehearsed.",
  "scorpio": "Scorpio, a dream you’ve held quietly becomes more realistic when you outline the first tangible step. Protect your vision — not everyone needs access to it yet.",
  "sagittarius": "Sagittarius, your social energy is shifting. You’re more selective, and that’s good. Choose plans that inspire movement, conversation, or discovery — everything else feels flat.",
  "capricorn": "Capricorn, ambition gets a dose of timing today. Wait for the right opening instead of pushing. Your patience pays off and gives you more leverage than force would.",
  "aquarius": "Aquarius, a travel or relocation idea returns with new clarity. Update the dream with your current priorities — it may look different now, but more achievable.",
  "pisces": "Pisces, confidence and emotion finally line up. You know what you want and can express it without drifting. A romantic moment or honest conversation feels grounding instead of overwhelming."
}
