{
  "aries": "Aries, today has main-character pacing. Move with intention, not urgency. One clear decision shifts the whole day forward. Keep your communication simple and direct; people follow your lead when you don’t oversell. Protect your focus like it’s part of your brand.",
  "taurus": "Taurus, slow confidence works better than force. Reorganize one part of your life — a drawer, schedule, or plan — and everything else aligns around it. A quiet conversation lands exactly how you hoped. Don’t chase; let things come toward you.",
  "gemini": "Gemini, keep things minimal today. Pick the version of you that feels the most honest and move from there. A short, blunt message clears up something you’ve been overthinking. Curate your environment — one small change boosts your whole mood.",
  "cancer": "Cancer, your calm is power today. Remove one emotional obligation that isn’t yours. People respond better when you speak plainly instead of cushioning everything. Make a practical plan for the next two days and stick to it. Subtle discipline feels good.",
  "leo": "Leo, today is about quiet magnetism, not performance. Focus on your priorities without broadcasting them. Someone notices your consistency more than your charm. Handle the unglamorous task first; it gives you more control over the rest of the day.",
  "virgo": "Virgo, precision meets intuition today. Clean up one system that’s been slowing you down — digital, mental, or physical. A direct question gets you the information you need. Let good be enough; the polished version isn’t required right now.",
  "libra": "Libra, streamline everything. Too many options are clouding your instinct. Pick one direction and commit. A simple, honest sentence diffuses tension faster than diplomacy. Your balance returns when you stop trying to be the steady one for everyone.",
  "scorpio": "Scorpio, today your clarity is sharp. You see exactly what isn’t working and don’t need to justify stepping back. One straightforward conversation sets a new tone. Channel your energy into something that builds over time, not something that burns fast.",
  "sagittarius": "Sagittarius, you move better with structure today. Limit yourself to one main focus so your attention stops scattering. A spontaneous idea is worth saving, not acting on. Keep plans flexible but grounded. Your independence feels cleaner with boundaries.",
  "capricorn": "Capricorn, your discipline hits a smooth stride. Handle the task that’s been taking up too much mental space. People respect your directness more than your restraint — say it clearly. Clear one small annoyance at home or work to reset your whole energy.",
  "aquarius": "Aquarius, be present rather than predictive. Listen fully; it changes the tone of a conversation you’ve been avoiding. A practical task you’ve put off becomes surprisingly easy when you finally touch it. Keep your evening slow and unscripted.",
  "pisces": "Pisces, you get a quiet reality check today — the good kind. Something you’ve been emotional about becomes simpler once you look at the facts. Make one small decision and stick to it. Minimal communication works best; say what’s true and leave it there."
}
