{
  "aries": "Aries, today moves cleanly once you cut the distractions. Make one decision early and let everything orbit around it. Keep your tone neutral but confident — it lands better than intensity. A quiet moment alone helps you recalibrate before the evening.",
  "taurus": "Taurus, simplify your priorities. Choose what actually matters and leave the rest undecided for now. A conversation goes better when you speak from facts instead of expectations. Keep your pace steady, not slow — consistent effort is enough today.",
  "gemini": "Gemini, your ideas stay sharper when you don’t multitask. Give yourself one lane and stick to it for a few hours. If something feels off socially, ask one direct question instead of analyzing every angle. A change of scenery boosts your clarity.",
  "cancer": "Cancer, stay grounded in your own timing. Don’t respond from emotion; respond from observation. Clean up one small area of your life to calm your mind. Someone’s mood isn’t your responsibility today — keep your boundaries clean and simple.",
  "leo": "Leo, quiet discipline works better than spotlight energy. Do the uninteresting task first and your whole day opens up. A short, honest sentence gets you further than a long explanation. Save your social battery for people who actually energize you.",
  "virgo": "Virgo, streamline your workflow. Your mind is sharp, but too many inputs dilute it. Ask for clear information if something feels messy. A practical decision replaces overthinking. Tonight, choose rest that feels intentional, not guilty.",
  "libra": "Libra, reduce the noise. Choose one priority, one plan, one direction. A straightforward message resolves something you’ve been tiptoeing around. Don’t aim for harmony; aim for truth. Your balance returns when your boundaries firm up.",
  "scorpio": "Scorpio, your intuition is crisp today. Trust the first impression but verify the details. A direct question clears tension quickly. Put energy into something long-term instead of reactive. End the day with a small ritual that recenters you.",
  "sagittarius": "Sagittarius, focus beats enthusiasm today. Limit distractions so your mind stops jumping tracks. Keep communication simple; humor isn’t required. A spontaneous thought is worth saving for later — not acting on immediately. Leave the night unplanned.",
  "capricorn": "Capricorn, set the tone early. Structure your tasks in short bursts and stick to them. Someone respects you more when you're concise. Handle one lingering annoyance; it frees more energy than expected. Let the evening be low-pressure.",
  "aquarius": "Aquarius, respond slower than you think you need to. Listening gives you an advantage today. A practical task you’ve avoided becomes easy once you start. Keep your environment minimal — it helps you think clearly. No overcommitting tonight.",
  "pisces": "Pisces, today brings clean emotional logic. Something that felt big now feels manageable when you break it into steps. Keep your communication simple and avoid explaining your feelings multiple times. A short walk or pause resets your perspective."
}
