{
  "aries": "Aries, today your focus sharpens. A task you’ve been circling finally feels doable once you break it into two clear steps. Keep your messages short and straightforward; people respond better to clarity than urgency. In relationships, a calm tone works better than a fast explanation. Give yourself one small win before the afternoon — it sets the pace for the rest of the day.",
  "taurus": "Taurus, something you’ve been planning needs a practical update. Rework your timeline and be honest about what’s realistic this week. A conversation you expect to be awkward actually goes smoother than you think. Don’t over-explain your reasoning — say the simple version and move on. A quiet moment helps you recenter before the evening.",
  "gemini": "Gemini, today favors direct communication. A quick check-in with someone clears up a misunderstanding faster than a long back-and-forth in your head. Your curiosity helps you read the situation accurately, so ask one thoughtful question and actually listen to the answer. A small change of environment — a walk, a different café, a different room — improves your mood more than scrolling will.",
  "cancer": "Cancer, today is about structure. Pick one personal goal and outline the next three actions without overthinking them. Keep your expectations realistic and focus on consistency. In relationships, respond slowly rather than emotionally; it keeps conversations constructive. A short break or reset mid-afternoon keeps you from slipping into old patterns.",
  "leo": "Leo, you’re efficient today. A task that felt heavy last week moves quickly once you give it uninterrupted attention. Someone appreciates your straightforwardness — you don’t need theatrics to get the point across. Double-check details before committing to plans. Tonight, some quiet time helps you decompress more than socializing will.",
  "virgo": "Virgo, today rewards simplicity. Don’t try to solve everything at once; pick the thing closest to your control and start there. A conversation improves when you shift from analysis to practicality. If someone comes to you with a problem, offer options, not solutions. By evening, your energy steadies and you’ll feel more in control of your week.",
  "libra": "Libra, today invites a reset. Re-evaluate one long-term plan and adjust your approach — not because you failed, but because you learned something. Set one realistic deadline. Socially, choose honesty over politeness if something’s been bothering you. The moment you say it clearly, the tension dissolves.",
  "scorpio": "Scorpio, your priorities line up cleanly today. You’ll know exactly what deserves your effort and what’s not worth it. Don’t ignore that instinct. One direct conversation saves you hours of guessing. Make a small adjustment to your routine; it opens more mental space than you expect. End the day with something grounding and quiet.",
  "sagittarius": "Sagittarius, today is about efficiency. Handle the boring tasks first — crossing them off frees your mind for the things you actually care about. Someone gives you useful information if you ask a clear question. Keep plans flexible; a better option might appear by late afternoon. A short walk or stretch resets your head.",
  "capricorn": "Capricorn, you operate best in focused blocks today. Handle one task fully before jumping to the next. A short, neutral conversation improves a work or home dynamic you’ve been tolerating. Trust your planning, but stay open to a smarter method if it shows up. By evening, you’ll feel a subtle but real sense of progress.",
  "aquarius": "Aquarius, today your communication lands well when you keep it simple. Someone opens up if you ask directly instead of hinting. At home, taking care of one small chore improves the whole environment. In relationships, presence beats cleverness — show up, listen, respond. Minimal effort, maximum clarity.",
  "pisces": "Pisces, today you gain perspective. Something that felt emotional last week looks more straightforward now. Break a personal goal into practical steps and commit to the first one. If a choice feels heavy, write down the pros and cons; the answer becomes obvious. A calm check-in with a friend or partner clears lingering tension."
}
