{
  "aries": "Aries, today feels like driving with the top down at golden hour — forward, unbothered, clear. Make the decision that keeps you moving. Someone reads your calm confidence louder than anything you say.",
  "taurus": "Taurus, romance feels like a slow cruise down familiar streets — steady, intentional, no pressure. Let the connection unfold without managing it. The right energy meets you halfway.",
  "gemini": "Gemini, travel calls you like a long stretch of empty highway. Look into a destination that’s been lingering in your mind. Even imagining it shifts your perspective in real time.",
  "cancer": "Cancer, your goals need motion, not perfection. Think: wheels rolling, music low, no rush. One small action today pushes the whole dream forward effortlessly.",
  "leo": "Leo, your confidence is dusk-coded — soft but unmistakable. People pick up on the glow around you. Use it to make a choice you’ve been hesitating on.",
  "virgo": "Virgo, your lifestyle wants an upgrade. Picture how you’d live if you were always catching sunsets from the driver’s seat — clean, organized, intentional. Make one choice that moves you closer.",
  "libra": "Libra, romance feels cinematic today — not dramatic, just visually magnetic. A simple gesture or short message pulls someone closer. You don’t need strategy; your presence is enough.",
  "scorpio": "Scorpio, a dream resurfaces like a familiar road you forgot you loved. Don’t question it. Follow the instinct and see where it leads — it’s pointing somewhere real.",
  "sagittarius": "Sagittarius, your energy craves movement. Take the long way home, explore a new area, or shift your plans at the last minute. The change in scenery wakes something up in you.",
  "capricorn": "Capricorn, money decisions feel clearer at dusk — direct, levelheaded, future-minded. Make the choice that aligns with who you're becoming, not who you were last year.",
  "aquarius": "Aquarius, a travel or relocation thought hits differently today. Picture your life somewhere else — coast, city, mountains. The version that excites you is the one worth exploring.",
  "pisces": "Pisces, romance and clarity meet in a clean line today — no fog, no guessing. Say what you feel with that calm, half-dusk confidence. It lands exactly how you intend."
}
