{
  "aries": "Aries, money clarity hits today. Look at your spending without judgment — one small adjustment puts you back in control. A quick, confident choice around finances sets up the rest of your week.",
  "taurus": "Taurus, creativity nudges you today. Don’t plan it, don’t perfect it — just start. A small sketch, note, or voice memo opens a new lane you didn’t see before.",
  "gemini": "Gemini, boundaries matter. Something or someone has been taking more of your time than you realized. Pull your energy back and watch how fast your focus returns.",
  "cancer": "Cancer, pace yourself. The day works best when you move slower than your instincts tell you to. Being deliberate keeps you from getting pulled into other people’s urgency.",
  "leo": "Leo, aesthetic choices set your tone. Wear something that aligns with who you’re becoming, not who you’ve been. A small grooming or style tweak lifts your confidence instantly.",
  "virgo": "Virgo, ambition activates today. Name the big goal without shrinking it. You don’t need the perfect strategy — you need a direction and a starting point.",
  "libra": "Libra, emotional clarity shows up cleanly. A situation that’s been blurry now reads sharp. Trust your first interpretation; it’s the correct one. Adjust accordingly.",
  "scorpio": "Scorpio, your problem-solving is elite today. Something complicated finally makes sense once you zoom out. Fix the root issue, not the symptoms — the whole thing untangles.",
  "sagittarius": "Sagittarius, rest is productive for you today. Slow down on purpose. Your best ideas come when you’re not chasing anything. Give yourself space and see what rises.",
  "capricorn": "Capricorn, relationships need straightforward communication. Say what you mean the first time — no buffering, no backtracking. It opens the door to the response you’ve been hoping for.",
  "aquarius": "Aquarius, upgrade your environment. Rearrange a small area or clean out digital clutter. Your mind gets sharper the second your surroundings stop distracting you.",
  "pisces": "Pisces, dreams meet discipline today. A vision you’ve held quietly becomes more realistic with one practical step. Don’t over-explain it; just begin building the first piece."
}
