{
  "aries": "Aries, a long-term goal clicks into focus today — not the flashy one, the one that actually matters. Map out the next two steps and ignore everything that tries to rush you. One quiet decision shifts the whole trajectory.",
  "taurus": "Taurus, something you’ve been dreaming about feels more possible once you strip away the unrealistic parts. You don’t need a perfect plan — you need a starting point. Keep your communication steady, not slow.",
  "gemini": "Gemini, your brain wants new input. Explore one idea you’ve been shelving — a skill, a location, a plan — and let yourself follow the thread without committing to it. A simple question cuts through confusion with someone close.",
  "cancer": "Cancer, today’s about strategy. Choose a long-term goal and reverse-engineer it: what needs to happen by Friday, by next month, by spring? Don’t ask for reassurance — ask for information. It gets you further.",
  "leo": "Leo, the version of your life you’ve been imagining needs one practical action today. Don’t announce it; just do it. A small win boosts your confidence more than external affirmation ever could.",
  "virgo": "Virgo, your dream is closer than you think — but the system supporting it needs a tune-up. Rebuild one workflow or routine that’s slowing you down. Someone’s advice is useful only if you filter out the noise.",
  "libra": "Libra, a long-standing desire gets honest today. Name what you actually want without softening it. Once you do, the path becomes surprisingly simple. A direct message clears up social uncertainty instantly.",
  "scorpio": "Scorpio, something you’ve wanted for years feels attainable once you stop hiding it behind practicality. Let yourself want the bigger version. Say no to anything that distracts you from the main mission.",
  "sagittarius": "Sagittarius, a dream you outgrew needs to be released so a newer one can take its place. Don’t cling out of nostalgia. Your clarity shows up when you give yourself room to pivot without guilt.",
  "capricorn": "Capricorn, today is about tightening your aim. Choose the goal that actually moves your life forward and cut the rest. Discipline feels natural, not forced. Someone respects your precision more than your patience.",
  "aquarius": "Aquarius, one of your long-term visions needs an update — the old version doesn’t match who you are now. Redraft it in realistic terms. A small logistical change brings immediate clarity.",
  "pisces": "Pisces, a dream that felt overwhelming becomes manageable once you define its structure. Create a clear boundary around your time so you can actually build it. Don’t over-explain your reasoning; your direction speaks for itself."
}
