{
  "aries": "Aries, today is about timing. Don’t rush into the first option—pause, observe, then act. The extra beat helps you pick the move that actually benefits you long-term.",
  "taurus": "Taurus, your daily routine needs a micro-upgrade. Swap one habit for something that makes you feel more grounded. The rest of your day aligns around that one change.",
  "gemini": "Gemini, self-image shifts today. You see yourself more accurately, without exaggeration or self-doubt. Make a choice that reflects this updated version of you.",
  "cancer": "Cancer, friendships take center stage. Reach out to someone you’ve been missing. One honest check-in strengthens a bond you want to keep.",
  "leo": "Leo, ambition is rising again. A long-term goal that felt distant suddenly feels within reach. Outline the next three steps with zero pressure to perfect them.",
  "virgo": "Virgo, focus returns the moment you remove one unnecessary responsibility. Clear mental space before trying to increase productivity.",
  "libra": "Libra, your home environment needs a refresh. Adjust lighting, move furniture, or clear clutter. The shift affects your mood more than you expect.",
  "scorpio": "Scorpio, discipline hits cleanly today. A task you’ve avoided becomes easy once you commit to the first two minutes. Momentum builds quickly after that.",
  "sagittarius": "Sagittarius, your social energy fluctuates. Protect it. Say yes only to plans that add something meaningful. Declining isn’t rude—it's strategic.",
  "capricorn": "Capricorn, clarity drops in bluntly. Something you were unsure about suddenly becomes obvious. Trust the new understanding and adjust your approach.",
  "aquarius": "Aquarius, reinvention is calling. Update something small—your profile, your routine, your goals list. It’s not superficial; it signals internal change.",
  "pisces": "Pisces, intuition guides logistics today. You know exactly where to go, what to do, and who to avoid. Follow the instinct; it’s unusually sharp."
}
